carts/scenarios/load.yaml
config:
  phases:
    - duration: 60
      arrivalCount: 2
  variables:
    customerId:
      - "1"
      - "2"
      - "3"
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/carts/{{ customerId }}"
      - post:
          url: "/carts/{{ customerId }}/items"
          json:
            itemId: "6d50b722-6596-4abd-8f10-f274275f4ec3"
            quantity: 2
            unitPrice: 10.50
      - think: 2
      - get:
          url: "/carts/{{ customerId }}/items"
      - get:
          url: "/health"