carts/scenarios/load.yaml
config:
  phases:
    - duration: 60
      arrivalRate: 0
      rampTo: 10
scenarios:
  - flow:
      - get:
          url: "/carts/1"
      - get:
          url: "/carts/1/items"
      - think: 1
      - post:
          url: "/carts/1/items"
          json:
            itemId: "6d50b722-6596-4abd-8f10-f274275f4ec3"
            quantity: 2
            unitPrice: 10.50
      - get:
          url: "/health"