carts/scenarios/load.yaml
config:
  phases:
    - duration: 120
      arrivalRate: 2
      rampTo: 50
  variables:
    customerId:
      - "1"
      - "2"
      - "3"
      - "4"
      - "5"
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/carts/{{ customerId }}"
      - get:
          url: "/carts/{{ customerId }}/items"
      - post:
          url: "/carts/{{ customerId }}/items"
          json:
            itemId: "6d50b722-6596-4abd-8f10-f274275f4ec3"
            quantity: 2
            unitPrice: 10.50
      - get:
          url: "/health"